# config.py

SCENE_CONFIG = {
    "厕所": {
        "num_labels": 2,
        "label_names": [
            "厕屋脏乱",
            "厕屋功能配备不齐全"
        ],
        "deduct": [2, 3],
        "model_name": "toilet_resnet18.pth"
    },

    "化粪池": {
        "num_labels": 3,
        "label_names": [
            "化粪池盖板挪开未关闭，取粪口未关闭",
            "化粪池粪污溢流",
            "厕所周围其他情况"
        ],
        "deduct": [2, 2, 1],
        "model_name": "septic_resnet18.pth"
    },

    "室内": {
        "num_labels": 10,
        "label_names": [
            "室内格局杂乱无章",
            "室内家具摆放杂乱无章",
            "室内生活用品杂乱无章",
            "鸡鸭是否进入屋内共居",
            "室内地面存在鸡鸭粪污",
            "鸡跳在室内桌子上",
            "室内地面垃圾乱丢现象严重",
            "室内桌面、沙发表面乱堆乱摆",
            "室内墙面污迹不堪",
            "室内其他脏乱情况"
        ],
        "deduct": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        "model_name": "indoor_resnet18.pth"
    },

    "庭院": {
        "num_labels": 12,
        "label_names": [
            "庭院内生产工具杂乱无章",
            "庭院内交通用具杂乱无章",
            "庭院内其他情况杂乱无章",
            "鸡鸭进入庭院乱跑",
            "庭院内鸡粪鸭粪满地",
            "庭院内地面垃圾乱丢现象严重",
            "庭院内柴草堆码无序",
            "庭院内柴草堆码不整齐",
            "庭院内房屋立面乱挂、乱画",
            "庭院内搭建棚、库破败、物品堆码杂乱不堪",
            "庭院污水横流",
            "庭院内其他情况"
        ],
        "deduct": [3, 3, 2, 2, 2, 5, 1, 2, 2, 5, 2, 1],
        "model_name": "courtyard_resnet18.pth"
    },

    "房前屋后": {
        "num_labels": 5,
        "label_names": [
            "房屋旁柴草堆码乱堆、不整齐",
            "房屋周身存在污水横流现象",
            "房屋周身瓜果棚架破败不堪",
            "房屋周身鸡鸭棚圈破败不堪、脏臭",
            "房屋周身其他情况"
        ],
        "deduct": [3, 2, 2, 2, 1],
        "model_name": "outside_resnet18.pth"
    }
}


DEFAULT_THRESHOLDS = {
    "厕所": [0.5, 0.5],
    "化粪池": [0.5, 0.5, 0.5],
    "室内": [0.55, 0.55, 0.55, 0.45, 0.45, 0.45, 0.50, 0.50, 0.50, 0.65],
    "庭院": [0.55, 0.55, 0.55, 0.45, 0.45, 0.50, 0.55, 0.55, 0.55, 0.55, 0.50, 0.65],
    "房前屋后": [0.55, 0.50, 0.50, 0.50, 0.65]
}